000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПравилаЦенообразования/ПравилаЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЦенообразования</name>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПравилЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыПравилЦенообразования/СтатусыПравилЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПравилЦенообразования</name>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>НеДействует</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПравилаЦенообразования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 08.11.2022 12:27:20
Функция ПолучитьПоНомеруМагазина(НомерМагазина)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПравилаЦенообразования.Ссылка КАК Правило
	|ИЗ
	|	Справочник.ПравилаЦенообразования КАК ПравилаЦенообразования
	|ГДЕ
	|	ПравилаЦенообразования.Наименование = &Наименование
	|	И НЕ ПравилаЦенообразования.ПометкаУдаления
	|	И ПравилаЦенообразования.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПравилЦенообразования.Действует)"
	);
	Запрос.УстановитьПараметр("Наименование", "Правило цен № " + Формат(НомерМагазина, "ЧЦ=3; ЧДЦ=; ЧН=000; ЧВН="));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

			Правило = Выборка.Правило;

	Иначе	Правило = Справочники.ПравилаЦенообразования.СоздатьЭлемент();
			Правило.Наименование    = Запрос.Параметры.Наименование;
			Правило.ЦенаВключаетНДС = Истина;
			Правило.Статус = Перечисления.СтатусыПравилЦенообразования.Действует;
			Правило.ВидЦен = Справочники.ВидыЦен.ПолучитьПоНомеруМагазина(НомерМагазина);

			Правило.ОбменДанными.Загрузка = Истина;
			Правило.Записать();
			Правило = Правило.Ссылка;

	КонецЕсли;

	Возврат Правило;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
